{
  "About": {
    "Name": "Ian Wilson",
    "Currently": "Information Systems Student",
    "Headshot": "student-portrait.JPEG",
    "Thumbnail": "student-logo.png",
    "Major": "Information Systems",
    "Graduation": "June 2025",
    "AboutText": "I’m a dedicated Information Systems major at Seattle Pacific University specializing in IT networking and network engineering. Known as the go-to “IT guy,” I’ve built a strong troubleshooting background across macOS, Windows, Wi-Fi networks, and custom PC assembly. Leading my Eagle Scout service project deepened my technical expertise and leadership skills. Outside of tech, I’m an avid camper and skier—activities that sharpen resilience, adaptability, and teamwork—and I’m excited to apply these skills to innovative IT projects alongside like-minded professionals."
  },
  "Contact": {
    "EMail": "wilsoni@spu.edu",
    "Phone": "",
    "Portfolio": "https://wilsoni02.github.io/index.html",
    "LinkedIn": "https://www.linkedin.com/in/ian-wilson-2020/",
    "GitHub": "https://github.com/wilsoni02"
  },
  "Experience": {
    "ExperienceText": "I’m an Information Systems major at Seattle Pacific University (Class of 2025) with hands-on experience troubleshooting technology and delivering customer support at Walgreens. As President of the Centurions Club and CompTIA Security+ candidate, I’ve honed leadership, project-management, and cybersecurity skills.",
    "School": "Seattle Pacific University",
    "Major": "Information Systems",
    "Graduation": "June 2025",
    "EducationText": "Information Systems Major with a Minor in History. President of the Centurions Club.",
    "Employment": "Walgreens",
    "Role": "Customer Service Associate",
    "EmploymentText": "Customer Service Associate at Walgreens, responsible for supporting customer needs and operational tasks.",
    "Skills": ["CyberSecurity", " JavaScript", " CSS", " HTML", " Flutter & Dart", " Computer Networking"],
    "SkillsText": "Proficient in cybersecurity protocols, modern web development using JavaScript, CSS, and HTML, mobile app development with Flutter & Dart, and the fundamentals of computer networking.",
    "Resume": "student-resume.pdf",
    "Internship": {
      "Company": "CompTIA Security+",
      "Role": "Certification Candidate",
      "Description": "Currently pursuing the CompTIA Security+ certification as an internship alternative. This process involves hands-on training in cybersecurity principles, risk management, and threat analysis, providing real-world skills and industry-relevant experience."
    }

  },
  "Project1": {
    "Title": "WinterArk",
    "Desc": "WinterArk is a gym-focused Android app for tracking workouts, chats, and shared dashboards.",
    "FullDesc": "WinterArk is a mobile app for Android 15.0 (Vanilla Ice Cream) designed specifically for gym-goers. Built with Flutter/Dart front-end and an AWS EC2 back-end, it enables workout logging, friend requests, one-on-one chat, quick reuse of previous workouts, and a Shared Dashboard & Gym Buddy system for peer motivation. Known issues: certain screens still lack full real-time Socket.IO events, forcing a refresh for updates. Future improvements: implement complete real-time event handling across all views and centralize timezone conversion logic on the server side.",

    "GitHubRepo": "https://github.com/WinterArk",
    "MainImage": "WinterArk.png",
    "DetailImages": ["WinterArkDemo.gif", "P1Detail1.png", "P1Detail2.png", "P1Detail3.png", "P1Detail4.png", "P1Detail5.png", "P1Detail6.png", "P1Detail7.png"],
    "ProjectType": "Team",
    "TeamRole": "Librarian, Scrum Master, Fullstack Development",
    "Course": "CSC 4151, 4152, 4898",
    "Period": "September 2024 - June 2025"
  },
  "Project2": {
    "Title": "Node-Project",
    "Desc": "A Node.js and Express-powered web application for task/list management. Features a responsive client interface for adding, editing, and deleting tasks, with an emphasis on non-blocking server interactions and error management.",
    "GitHubRepo": "https://github.com/wilsoni02/Node-Project",
    "MainImage": "P2Main.png",
    "DetailImages": [],
    "ProjectType": "Individual",
    "TeamRole": "",
    "Course": "CSC 3221, Netcentric Computing",
    "Period": "September - November 2023"
  },
  "Project3": {
    "Title": "HTTP-Project",
    "Desc": "A versatile JavaScript front-end library for handling HTTP requests (GET, POST, PUT, DELETE, PATCH). Features async operations, robust error handling, and a user-friendly UI for testing API responses using the Fetch API.",
    "GitHubRepo": "https://github.com/wilsoni02/HTTP-Project",
    "MainImage": "P3Main.png",
    "DetailImages": [],
    "ProjectType": "Individual",
    "TeamRole": "",
    "Course": "CSC 3221, Netcentric Computing",
    "Period": "September - November 2023"
  },
  "Project4": {
    "Title": "Task-Manager-Project",
    "Desc": "A full-stack Task Manager web app built with HTML, CSS, JavaScript, Node.js, Express, and Mongoose, featuring real-time updates using Socket.io. Supports task CRUD operations and stores data in MongoDB Atlas, with a focus on intuitive UI and efficient functionality.",
    "GitHubRepo": "https://github.com/wilsoni02/Task-Manager-Project",
    "MainImage": "P4Main.png",
    "DetailImages": [],
    "ProjectType": "Individual",
    "TeamRole": "",
    "Course": "CSC 3221, Netcentric Computing",
    "Period": "September - November 2023"
  }
}
