{
"About": {
  "Name": "Ian K. Wilson",
  "Currently": "Information Systems Student",
  "Headshot": "student-portrait.png",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Ian. I am a passionate Information Systems major with a keen interest in coding, data analysis, and system optimization. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of technology, with a particular focus on programming and practical application development.

I enjoy tackling challenging coding projects and thrive in environments where I can contribute my expertise and learn from my peers. During my studies, I have worked on several impactful projects, including my Eagle Scout project, which solidified my commitment to a career that combines my love for technology and problem-solving.

Beyond the classroom, I actively engage in activities related to technology and the outdoors, finding inspiration in camping and skiing. These experiences have taught me the importance of adaptability, perseverance, and teamwork—values I carry into my professional life.

Looking ahead, I am eager to leverage my skills and experience to contribute to innovative projects in Information Systems. I aspire to collaborate with like-minded individuals and organizations that value creativity, continuous learning, and positive impact. Let's connect and explore the possibilities together!"
},
"Contact": {
  "EMail": "wilsoni@spu.edu",
  "Phone": "",
  "Portfolio": "https://wilsoni02.github.io/index.html",
  "LinkedIn": "https://www.linkedin.com/in/ian-wilson-2020/",
  "GitHub": "https://github.com/wilsoni02"
},
"Experience": {
  "ExperienceText": "",
  "School": "Seattle Pacific University",
  "Major": "Information Systems",
  "Graduation": "June 2025",
  "EducationText": "Use this to add some narrative to your education section",
  "Employment": "Walgreens",
  "Role": "Customer Service Associate",
  "EmploymentText": "Use this to add some narrative to your employment section",
  "Skills": ["C++", " JavaScript", " Node", " CSS"," HTML"],
  "SkillsText": "Use this to add some narrative to your skills section",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "Interesting Project 1",
    "Desc": "This is a description of Project One.<br><br>It has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P1Main.png",
    "DetailImages": ["P1Detail1.png","P1Detail2.png","P1Detail3.png"]
  },
  "Project2": {
    "Title": "Interesting Project 2",
    "Desc": "This is a description of Project Two.<br><br>It also has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P2Main.png",
    "DetailImages": ["P2Detail1.png","P2Detail2.png","P2Detail3.png","P2Detail4.png"]
  },
  "Project3": {
    "Title": "Interesting Project 3",
    "Desc": "This is a description of Project Three.<br><br>It does not have a GitHub repo or any additional screenshots.",
    "GitHubRepo": "",
    "MainImage": "P3Main.png",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
