{
"About": {
  "Name": "Ian K. Wilson",
  "Currently": "Information Systems Student",
  "Headshot": "student-portrait.png",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Ian. I am a passionate Information Systems major with a keen interest in coding, data analysis, and system optimization. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of technology, with a particular focus on programming and practical application development. I enjoy tackling challenging coding projects and thrive in environments where I can contribute my expertise and learn from my peers. During my studies, I have worked on several impactful projects, including my Eagle Scout project, which solidified my commitment to a career that combines my love for technology and problem-solving. Beyond the classroom, I actively engage in activities related to technology and the outdoors, finding inspiration in camping and skiing. These experiences have taught me the importance of adaptability, perseverance, and teamwork—values I carry into my professional life. Looking ahead, I am eager to leverage my skills and experience to contribute to innovative projects in Information Systems. I aspire to collaborate with like-minded individuals and organizations that value creativity, continuous learning, and positive impact. Let's connect and explore the possibilities together!"
},
"Contact": {
  "EMail": "wilsoni@spu.edu",
  "Phone": "",
  "Portfolio": "https://wilsoni02.github.io/index.html",
  "LinkedIn": "https://www.linkedin.com/in/ian-wilson-2020/",
  "GitHub": "https://github.com/wilsoni02"
},
"Experience": {
  "ExperienceText": "",
  "School": "Seattle Pacific University",
  "Major": "Information Systems",
  "Graduation": "June 2025",
  "EducationText": "Information System's Major with a Minor in History. President of the Centurions Club.",
  "Employment": "Walgreens",
  "Role": "Customer Service Associate",
  "EmploymentText": "Customer Service Associate at Walgreems",
  "Skills": ["C++", " JavaScript"," CSS"," HTML", "System Designing"],
  "SkillsText": "Relevant knowledge to coding in C++ and web designing using JavaScript, CSS, and HTML.",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "Task-Manager-Project",
    "Desc": " A full-stack Task Manager web app built with HTML, CSS, JavaScript, Node.js, Express, and Mongoose, featuring real-time updates using Socket.io. It supports task CRUD operations and stores data in MongoDB Atlas, with a focus on intuitive UI and a efficient functionality.",
    "GitHubRepo": "https://github.com/wilsoni02/Task-Manager-Project",
    "MainImage": "P1Main.png",
    "DetailImages": ["P1Detail1.png","P1Detail2.png","P1Detail3.png"]
  },
  "Project2": {
    "Title": "Node-Project",
    "Desc": "A Node.js and Express-powered web application for task/list management. Features a responsive client interface for adding, editing, and deleting tasks, with a focus on non-blocking, error-managed server interactions.",
    "GitHubRepo": "https://github.com/wilsoni02/Node-Project",
    "MainImage": "P2Main.png",
    "DetailImages": ["P2Detail1.png","P2Detail2.png","P2Detail3.png","P2Detail4.png"]
  },
  "Project3": {
    "Title": "HTTP-Project",
    "Desc": "A versatile JavaScript front-end library for handling HTTP requests (GET, POST, PUT, DELETE, PATCH). Features async operations, error handling, and a user-friendly UI for testing API responses. Utilizes Fetch API for efficient, non-blocking requests and response handling.",
    "GitHubRepo": "https://github.com/wilsoni02/HTTP-Project",
    "MainImage": "P3Main.png",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
